app/controllers/blogconfigs_controller.rb

SELECT  "blogconfigs".* FROM "blogconfigs" WHERE "blogconfigs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    @blogconfig = Blogconfig.find 1

SELECT  "blogconfigs".* FROM "blogconfigs" WHERE "blogconfigs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @blogconfig = Blogconfig.find 1