app/controllers/bloggenres_controller.rb

	def index
		@data = Bloggenre.all
---
SELECT "bloggenres".* FROM "bloggenres"

	def edit
		@bloggenre = Bloggenre.find params[:id]
---
SELECT  "bloggenres".* FROM "bloggenres" WHERE "bloggenres"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]