app/controllers/cards_controller.rb

SELECT "cards".* FROM "cards"
---
  def index
    @cards=Card.all

SELECT  "cards".* FROM "cards" WHERE "cards"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
  def show
    @card = Card.find(params[:id])