app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages"
---
  def index
    @msg='Message data'
    @data=Message.all

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def show
    @msg="Indexed data."
    @message=Message.find(params[:id])

INSERT INTO "messages" ("person_id", "title", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["person_id", 1], ["title", "へろ〜"], ["message", "ハローです"], ["created_at", 2017-05-11 05:24:21 UTC], ["updated_at", 2017-05-11 05:24:21 UTC]]
---
  def create
    @message=Message.new message_params
    if @message.save then